brew 'fish'
brew 'zsh'
brew 'wget'
brew 'speedtest-cli'
brew 'tmux'
brew 'python'
brew 'shellcheck'
brew 'tldr'
brew 'rbenv'
brew 'figlet'
brew 'cowsay'
brew 'koekeishiya/formulae/yabai'
brew 'skhd'
brew 'neofetch'

# installation of apps from the Mac App Store through the command line
brew 'mas'

cask_args appdir: '/Applications'

# cask apps
# notion, vscode not on cask repo
cask 'spotify'
cask 'iterm2'
cask 'google-chrome'
cask '1password'
cask '1password-cli'
cask 'bbedit'
cask 'discord'

# App Store Apps
mas "Tot", id: 1491071483          # Tot
mas "Todoist", id: 585829637       # Todoist
mas "Fantastical", id: 975937182   # Fantastical
mas "Slack", id: 803453959         # Slack
mas "RunCat", id: 1429033973       # Run cat
mas "Pcalc", id: 403504866         # Pcalc
mas "Vimari", id: 1480933944       # Vimari
